// Note: this file is encoded in the PC-8 / Code Page 437 / OEM-US character set
// (The same character set used by Liberal Crime Squad when it is running)
// Certain special characters won't display correctly unless your text editor is
// set to use that character set, such as this e with an accent: e'

// In Windows Notepad with the Terminal font, OEM/DOS encoding it should work fine.
// You can set this in Notepad by going to Format->Font and choosing the Terminal font,
// then choosing OEM/DOS in the Script dropdown box.

// In Notepad++ go to the Encoding menu, Character sets, Western European, OEM-US... easy!

// In Code::Blocks's editor go to Settings->Editor->the Other Settings tab and
// then pick WINDOWS-437 from the dropdown box and then choose the radio button
// to make this the default encoding and disable auto-detection of the encoding.
// Then close the file and reopen it (since Code::Blocks detects the encoding
// when it opens the file and it can't be changed after that; what we changed was
// how it detects encoding for files it opens in the future, not files already open).

// In Microsoft Visual C++, right-click the file in the Solution Explorer,
// select "Open With...", choose "C++ Source Code Editor (with encoding)",
// then choose "OEM United States - Codepage 437".

// In MS-DOS Editor (included with Windows as EDIT.COM in your system32 directory),
// the codepage will be correct already since it's running in a console window just
// like Liberal Crime Squad. Well OK, the encoding might be wrong, but then it's wrong
// in Liberal Crime Squad TOO, and to fix it, go to Control Panel, Regional and Language Settings,
// Advanced tab, and choose English (United States) from the dropdown box as the encoding
// for non-Unicode applications, then press OK.

// If you have a Linux or other UNIX-based system you are obviously smart enough
// to figure out for yourself how to open a file in OEM-US PC-8 codepage 437 in
// your favorite text editor. If you're on Mac OS X, well that's UNIX-based, figure
// it out for yourself.

#include <externs.h>

// Add an age estimate to a person's name
void add_age(Creature& person)
{
   // Who knows how old the purple gorilla/tank/flaming bunny/dog is?
   if(person.animalgloss!=ANIMALGLOSS_NONE)
   {
      addstr(" (?)");
      return;
   }

   // For humans, estimate their age and gender
   addstr(" (");

   // Almost precise estimates of child and teen ages
   if(person.age<20)
   {
      // Inaccuracy in estimating age should be the same every
      // time a character is queried. I'm using the day of the
      // month the character was born on to determine this.
      addstr(person.age+person.birthday_day%3-1);
      addstr("?");
   }
   // More rough estimates of everyone else
   else
   {
      if(person.age<30)
         addstr("20代");
      else if(person.age<40)
         addstr("30代");
      else if(person.age<50)
         addstr("40代");
      else if(person.age<60)
         addstr("50代");
      else if(person.age<70)
         addstr("60代");
      else if(person.age<80)
         addstr("70代");
      else if(person.age<90)
         addstr("80代");
      else
         addstr("かなりの高齢");
   }

   // Assess their gender Liberally but allow ambiguity since you don't know them well enough yet
   if(person.gender_liberal == GENDER_MALE)
      addstr("、男性");
   else if(person.gender_liberal == GENDER_FEMALE)
      addstr("、女性");
   else
      addstr("、性別不明");

   // Note if there's some conflict with Conservative society's perceptions
   if(person.gender_liberal != person.gender_conservative && person.gender_liberal != GENDER_NEUTRAL)
      addstr("?");

   addstr(")");
}


/* rolls up a proper name for a creature */
void Creature::namecreature()
{
   if(!dontname)
   {
      generate_name(name, gender_liberal);
      strcpy(propername,name);
      dontname = true;
   }
}



/* fills a string with a proper name */
void generate_name(char *str, char gender)
{
   char first[80];
   char last[80];

   generate_name(first,last,gender);
   strcpy(str,first);
   strcat(str,"・");
   strcat(str,last);
}



/* get a first and last name for the same person */
void generate_name(char *first, char *last, char gender)
{
   do {
      firstname(first, gender);
      lastname(last, gender == GENDER_WHITEMALEPATRIARCH);
   } while(strcmp(first,last) == 0);
}



/* get a first, middle, and last name for the same person */
void generate_long_name(char *first, char *middle, char *last, char gender)
{
   // pick either male or female so we can have 75% chance of first and middle names having matching genders
   if(gender == GENDER_NEUTRAL)
      gender = (LCSrandom(2)?GENDER_MALE:GENDER_FEMALE);
   do {
      firstname(first, gender);
      if(LCSrandom(2)) // middle name is a first name
         firstname(middle,(gender == GENDER_WHITEMALEPATRIARCH || LCSrandom(2)?gender:GENDER_NEUTRAL)); // 25% chance for middle name of other gender unless white male patriarch
      else // middle name is a last name
         lastname(middle, gender == GENDER_WHITEMALEPATRIARCH);
      lastname(last, gender == GENDER_WHITEMALEPATRIARCH);
   } while(strcmp(first,middle) == 0 && strcmp(first,last) == 0 && strcmp(middle,last) == 0);
}



/* gets a random first name */
void firstname(char *str, char gender)
{
   static const char *male_first_names[] =
   {
   "アーロン",   "アブドル",   "アブナー",   "アブラハム",
   "アダム",   "アドナン",   "アードルフ",   "アドルフ",
   "アハメド",   "アイダン",   "アリ",   "アラン",
   "アルベルト",   "アレック",   "アレハンドロ",   "アレクサンダー",
   "アレクセイ",   "アルフ",   "アルフィー",   "アルフォンス",
   "アルフレッド",   "アラン",   "アレン",   "アルフォンス",
   "アルバロ",   "アルビン",   "アンドラス",   "アンドレ",
   "アンドレイ",   "アンドリュー",   "アンディ",   "アンジェロ",
   "アンガス",   "アンサニー",   "アントニオ",   "アントニー",
   "アーチボルド",   "アーキー",   "アリー",   "アーノルド",
   "アールパード",   "アート",   "アーサー",   "アッチラ",
   "オーガスト",   "オースティン",   "アビ",   "アクセル",
   "バール",   "バラク",   "バシャー",   "バジル",
   "ベントラン",   "バルネー",   "バリー",   "バート",
   "バーソロミュー",   "ボー",   "ベラ",   "ベン",
   "ベネディクト",   "ベニト",   "ベンジャミン",   "ベニー",
   "ブノワ",   "バーナード",   "バーニー",   "ベルト",
   "バートランド",   "ビラル",   "ビル",   "ビリー・ボブ",
   "ブレーク",   "ボブ",   "ボフミル",   "ボレスワフ",
   "ボーリス",   "ブラッド",   "ブラッドレー",   "ブランドン",
   "ブレンドン",   "ブレント",   "ブライアン",   "ブロンコ",
   "ブルース",   "ブルータス",   "ブリアン",   "ババ",
   "バスター",   "バイロン",   "カイン",   "カル",
   "カルビン",   "カール",   "カルロス",   "カシミール",
   "カシウス",   "セシル",   "セザール",   "チャド",
   "カイム",   "チャールズ",   "チャーリー",   "チャンシー",
   "チェスター",   "チャック",   "チャッキー",   "クリスチャン",
   "クリストファー",   "キーラン",   "シッド",   "クロード",
   "クラウディウス",   "クリフ",   "クリフォード",   "クライブ",
   "クライブン",   "クロビス",   "クライド",   "コリン",
   "コルトン",   "コンラッド",   "コッパー",   "クレイグ",
   "クサバ",   "サイラス",   "デイル",   "ダラス",
   "デミアン",   "ダモン",   "ダン",   "ダンフォース",
   "ダニエル",   "ダニー",   "ダグ",   "ダグウッド",
   "デイブ",   "デイビッド",   "デイビー",   "ディーン",
   "ディーパック",   "デニス",   "デンゼル",   "デラク",
   "デリク",   "デリック",   "デクスター",   "ディック",
   "ディエゴ",   "ディルバート",   "ディネシュ",   "ディンク",
   "ディーノ",   "ディワカール",   "ドブロミル",   "ドック",
   "ドム",   "ドミニク",   "ドン",   "ドナルド",
   "ドノバン",   "ダグ",   "ダグラス",   "ダスティン",
   "ダスティー",   "ドウェイン",   "ドワイト",   "ディラン",
   "アール",   "エド",   "エディー",   "エドガー",
   "エドアルド",   "エドワード",   "エドウィン",   "エマヌエル",
   "エメット",   "イーライ",   "エリア",   "エリアン",
   "エリアス",   "エリオ",   "エリオット",   "エルマー",
   "エルビス",   "エミール",   "エミリアーノ",   "エンリコ",
   "エンリケ",   "エンゾ",   "エリック",   "エリク",
   "アーネスト",   "アーニー",   "エルンスト",   "イーサン",
   "ユージーン",   "エバン",   "エボ",   "エゼキエル",
   "エズラ",   "ファビオ",   "フィリックス",   "フェルディナンド",
   "フェレンツ",   "フェルナンド",   "フィデル",   "フィッシャー",
   "フロイド",   "フォレスト",   "フランセスコ",   "フランシス",
   "フランシスコ",   "フランク",   "フランクリン",   "フランツ",
   "フレッド",   "フレディ",   "フレデリック",   "フリッツ",
   "ガボール",   "ガブリエル",   "ギャレット",   "ガレス",
   "ガース",   "ゲイリー",   "ジョージ",   "ジェラルド",
   "ヘラルド",   "ゲーザ",   "ギルバート",   "ジョバンニ",
   "グルン",   "グレン",   "グラハム",   "グレッグ",
   "グレゴリー",   "ガス",   "グスタフ",   "ガイ",
   "ジェルジュ",   "ジュラ",   "ハーフェズ",   "ヘイガー",
   "アキーム",   "ハミード",   "ハンク",   "ハンニバル",
   "ハンズ",   "ハロルド",   "ハリー",   "ハーベイ",
   "ハインリヒ",   "ヘンリー",   "ハーブ",   "ハーバート",
   "ヘルマン",   "ヒロ",   "ヒロシ",   "ホーマー",
   "ハワード",   "ホーウィー",   "ヒュー",   "ヒューゴ",
   "ハンター",   "イアン",   "イーゴリ",   "アイク",
   "イムレ",   "イングマール",   "アイラ",   "アービング",
   "アイザック",   "イスラエル",   "イジュトバン",   "イワン",
   "ジャック",   "ヤコビ",   "ジャコボ",   "ジェイク",
   "ジャミル",   "ジェームス",   "ヤノス",   "ジャレド",
   "ジェイソン",   "ハビエル",   "ジェイ",   "ジェブ",
   "ジェデダイア",   "ジェフ",   "ジェファーソン",   "ジェフリー",
   "エレミヤ",   "ジェレミー",   "イェルン",   "ジェローム",
   "ジェリー",   "ジェシー",   "ジーザス",   "ジム",
   "ジンボ",   "ジミ",   "ジミー",   "ジンユアン",
   "ジョー",   "ジョエル",   "ジョーイ",   "ヨハン",
   "ジョン",   "ジョニー",   "ジャン",   "ジョナサン",
   "ジョルジ",   "ホセ",   "ヨゼフ",   "ジョセフ",
   "ジョシュ",   "ジョシュア",   "ジョーワル",   "ヨージェフ",
   "ファン",   "ユダ",   "ジュード",   "ジュリアン",
   "ユリウス",   "ジャスティン",   "ケレン",   "カメル",
   "ケイン",   "カール",   "カーロイ",   "キース",
   "ケン",   "ケニー",   "ケンジ",   "ケネス",
   "ケビン",   "カリル",   "カーク",   "コフィ",
   "コンスタンティン",   "カート",   "クワイサイ",   "カイル",
   "ラックラン",   "ラジョス",   "ラマー",   "ランス",
   "ランスロット",   "ラリー",   "ラースロー",   "ローレンス",
   "レニー",   "レオ",   "レオン",   "レオナルド",
   "ルロワ",   "レフ",   "リーバイ",   "レックス",
   "リアム",   "リーナス",   "ライオネル",   "ロイド",
   "ロタール",   "ルイ",   "ロウェル",   "ルーカス",
   "ルシファー",   "ルシウス",   "ラディック",   "ルイージ",
   "ルイス",   "ルーク",   "ルーサー",   "ライル",
   "マルコム",   "マンフレッド",   "マニー",   "マヌエル",
   "マーク",   "マルコ",   "マーカス",   "マーダック",
   "マービン",   "マルク",   "マルコス",   "マリオ",
   "マーティン",   "マートン",   "マーティー",   "メイソン",
   "マット",   "マシュー",   "マッテオ",   "マティアス",
   "モーリス",   "モーリー",   "マクシミリアン",   "メフメト",
   "メルビン",   "マイケル",   "ミック",   "ミッキー",
   "ミゲル",   "マイク",   "マイキー",   "ミハイル",
   "マイルス",   "ミルトン",   "ミロスラフ",   "ミッチ",
   "ミッチェル",   "ミット",   "モウ",   "ムハンマド",
   "モリス",   "モーゼ",   "モシェ",   "ムムターズ",
   "マレー",   "ムスタファ",   "マイロン",   "ナポレオン",
   "ネイト",   "ネイサン",   "ナサニエル",   "ネッド",
   "ニール",   "ナイル",   "ネルソン",   "ニュート",
   "ニュートン",   "ニコラス",   "ニック",   "ノア",
   "ノーム",   "ノルム",   "ノーマン",   "オラフ",
   "オリバー",   "オーラル",   "オサマ",   "オスカー",
   "オーティス",   "オットー",   "オーウェン",   "パブロ",
   "パスカル",   "パトリック",   "パットン",   "ポール",
   "ペドロ",   "パーシバル",   "パーシー",   "パルベーズ",
   "ピート",   "ピーター",   "ペテロ",   "フィル",
   "フィリップ",   "フィリップス",   "フェリペ",   "ピエール",
   "ピアズ",   "プレスコット",   "プレストン",   "クエンティン",
   "クインシー",   "クサイ",   "ラドスラフ",   "ラファエル",
   "ラルフ",   "ロルフ",   "ランドール",   "ランディー",
   "レイン",   "ランサム",   "ラファエロ",   "ラウル",
   "レイ",   "レイモンド",   "レジナルド",   "レジス",
   "レクス",   "リカルド",   "リッチ",   "リチャード",
   "リッチー",   "リック",   "リッキー",   "リンゴ",
   "ロブ",   "ロバート",   "ロビー",   "ロッド",
   "ロドニー",   "ロジャー",   "ロメオ",   "ロン",
   "ロナルド",   "ローリー",   "ロイ",   "ルビン",
   "ルドルフ",   "ルードルフ",   "ルディ",   "ルーファス",
   "ルパート",   "ラッシュ",   "ラス",   "ラッセル",
   "ライアン",   "サダム",   "サンビル",   "サムソン",
   "サムエル",   "サンダー",   "シャーンドル",   "サンフォード",
   "スコット",   "ショーン",   "セバスチャン",   "サージ",
   "セルゲイ",   "セルジョ",   "セス",   "シェーン",
   "ショウン",   "ショーン",   "シェルドン",   "シャーロック",
   "シャーマン",   "シェロッド",   "シド",   "サイモン",
   "サニー",   "スパイク",   "スピロ",   "スタン",
   "スタニスラウス",   "スタニスラフ",   "スタンレー",   "ステファン",
   "スティーブ",   "スティーブン",   "スチュワート",   "スチュ",
   "ステュアート",   "タマス",   "テッド",   "テディー",
   "テレンス",   "テツオ",   "テオ",   "セオドア",
   "トーマ",   "トーマス",   "ソアー",   "ティベリウス",
   "ティム",   "ティモシー",   "タイタス",   "トビー",
   "トッド",   "トム",   "トミー",   "トニー",
   "トシロー",   "トラビス",   "トレイボン",   "トレバー",
   "タッカー",   "タイラー",   "タイロン",   "タイソン",
   "ウダイ",   "ユーサー",   "バシリー",   "ビクター",
   "ビクトル",   "ビンス",   "ビンセント",   "ブラド",
   "ウラジミール",   "ウラジスラフ",   "ブラスティミル",   "ビャチェスラフ",
   "ドウェイン",   "ウォーリー",   "ウォルト",   "ワルター",
   "ウェイン",   "ウェンデル",   "ウィルヘルム",   "ウィル",
   "ウィリアム",   "ウィリー",   "ビリー",   "ウィンストン",
   "ボイチェフ",   "ウルフ",   "ウッドロウ",   "ウッディー",
   "ワイアット",   "ザンダー",   "シャビエル",   "ヤコブ",
   "ヤン",   "ヤセル",   "ヨシ",   "ユセフ",
   "ザッカリー",   "ザック",   "ザイド",   "ズビグネフ",
   "ゼブロン",   "ジーク",   "ゾルタン",   "ジグモンド"
   };

   static const char *female_first_names[] =
   {
   "アビー",   "アビゲイル",   "エイダ",   "アドリアナ",
   "アドリアーナ",   "アドレアナ",   "アガサ",   "アニエス",
   "アイコ",   "アイリーン",   "アルバータ",   "エイリーン",
   "アレクサンドラ",   "アレクサ",   "アレグサンドラ",   "アリス",
   "アリシア",   "アリソン ",   "アリスン",   "アラニヤ",
   "アロラ",   "アリスン",   "アリッサ",   "アマンダ",
   "アンバー",   "アメリア",   "アメリ",   "アメリカ",
   "エイミー",   "アンナ",   "アナスタシア",   "アンドレア",
   "アンジェラ",   "アンジェリカ",   "アンジェリーナ",   "アンジェリーク",
   "アンジー",   "アニサ",   "アニタ",   "アン",
   "アンナ",   "アニー",   "アンマリー",   "アネリ",
   "アニス",   "アニヤ",   "エイプリル",   "アリアドネ",
   "アリアナ",   "アリアンナ",   "アスマ",   "アストリッド",
   "アテナ",   "オードラ",   "オードリー",   "アウラ",
   "オータム",   "エバ",   "アイラ",   "アイン",
   "バーブ",   "バーバラ",   "バービー",   "ビー",
   "ビアトリス",   "ベアトリクス",   "ビビ",   "ベッカ",
   "ベッキー",   "ベラ",   "ベル",   "バーナデット",
   "バーナディン",   "バーニス",   "バーサ",   "ベス",
   "ベサン",   "ベサニー",   "ベティ",   "ビアンカ",
   "ブランチ",   "ボニータ",   "ボニー",   "ブリー",
   "ブレンダ",   "ブリアナ",   "ブリアン",   "ブリジット",
   "ブリギッド",   "ブリジッテ",   "ブリトニー",   "ブルターニュ",
   "ブリトニー",   "ブルック",   "ブルックリン",   "カミラ",
   "カミーラ",   "キャンディス",   "キャンディ",   "カレーナ",
   "カリーナ",   "カーラ",   "カルメン",   "キャロル",
   "キャロライナ",   "キャロライン",   "キャス",   "カサンドラ",
   "ケイト",   "キャサリン",   "キャスリーン",   "キャシー",
   "セシリア",   "セリーヌ",   "チャリティ",   "シャーリーン",
   "シャーリーズ",   "シャーロット",   "チャスティティ",   "チェルシー",
   "チェリー",   "シェリル",   "クロエ",   "クリスティナ",
   "クリスティーン",   "クリスティ",   "シンディー",   "シンディ",
   "クレア",   "クララ",   "クラリッサ",   "クラリティ",
   "クローデット",   "クラウディア",   "クレファス",   "クレオパトラ",
   "コレット",   "コリーン",   "コンスウェラ",   "コンテッサ",
   "コリーヌ",   "コルネリア",   "クリスタル",   "シビル",
   "シンシア",   "デイジー",   "ダコタ",   "ダニエラ",
   "ダニエル",   "ダフネ",   "ドーン",   "デビー",
   "デブラ",   "デリラ",   "ダニエレ",   "デニス",
   "デザレイ",   "ダイアナ",   "ダイアン",   "ディミトラ",
   "ディナ",   "ダナ",   "ドーラ",   "ドリーン",
   "ドリス",   "ドロテア",   "ドロシー",   "ドロッチャ",
   "エボニー",   "イディス",   "エドナ",   "エレイン",
   "エカテリーナ",   "イレーヌ",   "エリナ",   "エレナ",
   "エリノア",   "エリザ",   "エリザベス",   "エレン",
   "エロイース",   "エルシー",   "エルビラ",   "エミリー",
   "エマ",   "エンティサ",   "エリカ",   "エーリカ",
   "エリン",   "エリス",   "エルマ",   "エルジェベート",
   "エスメラルダ",   "エスタ",   "ユードラ",   "ユーフェミア",
   "イーバ",   "イブ",   "フェイス",   "ファニー",
   "ファティマ",   "フェイ",   "フェリシア",   "フェリシティ",
   "フィオナ",   "フロー",   "フローラ",   "フローレンス",
   "フロリダ",   "フラン",   "フランシン",   "フリーダ",
   "ギャビー",   "ガブリエラ",   "ガブリエル",   "ギャラクシナ",
   "ガナ",   "ガビア",   "ジョージア",   "ガートルード",
   "ジーナ",   "ジョバンナ",   "グロリア",   "ゴルダ",
   "グレイス",   "グレタ",   "グレッチェン",   "グベン",
   "グエンドリン",   "ギネス",   "ヘイリー",   "ハラ",
   "ヘイリー",   "ハンナ",   "ハーモニー",   "ハリエット",
   "ハーレイ",   "ヘーゼル",   "ヘザー",   "ヘレン",
   "ヘレナ",   "ヘルガ",   "ヒルダ",   "ホリー",
   "ホーリー",   "オナー",   "イーダ",   "イロナ",
   "イルゼ",   "イングリッド",   "イレーネ",   "アイリス",
   "イザベル",   "イサベラ",   "イザベル",   "アイラ",
   "イバナ",   "アイビー",   "イジー",   "ジャクリン",
   "ジェイダ",   "ジェイド",   "ジェーン",   "ジャネット",
   "ジャネ",   "ジャニス",   "ジャニュエリ",   "ジャケリネ",
   "ジャスミン",   "ジャスマン",   "ジェン",   "ジェニファー",
   "ジェニー",   "ジェシカ",   "ジル",   "ジリアン",
   "ジョアン",   "ジョアナ",   "ジョディ",   "ジョーディ",
   "ジョセフィーヌ",   "ジョイ",   "ジューディス",   "ジュディ",
   "ジュリア",   "ジュリアーナ",   "ジュリー",   "ジュリエット",
   "ジュリエッタ",   "ジューン",   "ジャスティナ",   "ジャスティン",
   "ケイトリン",   "ケイリー",   "カレン",   "カリーナ",
   "カーラ",   "カルメン",   "カタリーン",   "ケイト",
   "ケイトリン",   "カテリーナ",   "カサリン",   "キャスリン",
   "キャシー",   "ケイティ",   "カトリーナ",   "ケイ",
   "ケイラ",   "ケイリー",   "キーリー",   "ケイシャ",
   "キキ",   "キルスティン",   "クララ",   "クリステル",
   "クリステン",   "クリスティ",   "クリスティン",   "クリスタル",
   "レイシー",   "レイニー",   "ラナ",   "ラーラ",
   "ラリサ",   "ラトーヤ",   "ローラ",   "ローレン",
   "ローリー",   "ラベンダー",   "リア",   "レア",
   "リーラ",   "レイア",   "ライラ",   "レナ",
   "レクシー",   "レイナ",   "リリアナ",   "リリス",
   "リリー",   "リリ",   "リナ",   "リンダ",
   "リサ",   "リブ",   "リズ",   "リーザ",
   "リザベス",   "リズベス",   "リジー",   "ロイス",
   "ロニーナ",   "ロレッタ",   "ロレーヌ",   "ローリィ",
   "ルアンヌ",   "ルアン",   "ルイーザ",   "ルイーズ",
   "ルカ",   "ルシア",   "ルーシー",   "ルッキ",
   "ルイサ",   "ルナ",   "リディア",   "リン",
   "リーン",   "リネット",   "ライラ",   "マドンナ",
   "マグス",   "ミリアム",   "マンディ",   "マンゴー",
   "マヌエラ",   "マーシャ",   "マーシー",   "マーガレット",
   "マルガレーテ",   "マルガリータ",   "マージ",   "マーギット",
   "マリア",   "マリアン",   "マリアーナ",   "マレリン",
   "マリーベル",   "メアリー",   "マリエル",   "マリリン",
   "マリナ",   "マリオン",   "マーレ",   "マリーナ",
   "マリーン",   "マーシャ",   "マータ",   "マーサ",
   "マーティナ",   "マリー",   "メリーアン",   "マチルダ",
   "モーラ",   "モーリン",   "マクシン",   "マヤ",
   "マユミ",   "メイジー",   "メディア",   "メグ",
   "メーガン",   "ミーガン",   "メグミ",   "メラニー",
   "メリンダ",   "メリッサ",   "メロディ",   "メルバニ",
   "メルセデス",   "ミリサ",   "ミア",   "ミシェル",
   "ミッシェル",   "ミカ",   "ミレナ",   "ミリー",
   "ミミ",   "マイナル",   "ミンディ",   "ミニー",
   "ミランダ",   "モリー",   "モニカ",   "モニーク",
   "モーラ",   "ナデジダ",   "ナディア",   "ナディヌ",
   "ナージャ",   "ナン",   "ナンシー",   "ナオミ",
   "ナタリア",   "ナタリー",   "ナターシャ",   "ネル",
   "ネリ",   "ネリー",   "ニコル",   "ニコレット",
   "ニーナ",   "ノエミ",   "ノラ",   "ノーマ",
   "オクトーバー",   "オルガ",   "オリビア",   "オプラ",
   "オルリー",   "パム",   "パメラ",   "パンドラ",
   "パトリシア",   "パティ",   "ポーラ",   "ポーレット",
   "ポーリン",   "ピーチ",   "パール",   "ペギー",
   "ペネロープ",   "ペニー",   "ペチュニア",   "フィービィー",
   "フィリス",   "パイパー",   "ピロシュカ",   "ポリーナ",
   "ポリー",   "プラーシュ",   "プリシラ",   "プルーデンス",
   "レイチェル",   "ラシェル",   "レイチェル",   "ラッチェル",
   "ラガド",   "ラモナ",   "ラーナ",   "ラニア",
   "ラファエラ",   "ラクエル",   "レイリン",   "レベッカ",
   "レジーナ",   "ルネ",   "リタ",   "ロミ",
   "ローザ",   "ロザリー",   "ロザリンド",   "ロザリンダ",
   "ロザーナ",   "ロザンヌ",   "ロベルタ",   "ローズ",
   "ローズマリー",   "ロージー",   "ロクサーヌ",   "ロクサン",
   "ロズ",   "ルツ",   "ルーサン",   "サブリナ",
   "サブリゼ",   "サジダ",   "サリー",   "サマンサ",
   "サミア",   "サミラ",   "サンドラ",   "サラ",
   "サーラ",   "サティア",   "セバ",   "セルマ",
   "セレナ",   "シャニークワ",   "シャナ",   "シャロン",
   "シェナン",   "シェリー",   "シャーリー",   "シャーン",
   "シャン",   "シルビア",   "ソフィア",   "ソフィー",
   "ソーナリ",   "ソニア",   "ゾフィア",   "ゾフィー",
   "ソラヤ",   "ステイシー",   "スティシィ",   "ステフ",
   "ステファニー",   "スハ",   "サマー",   "スー",
   "スーザン",   "スザンナ",   "スザンヌ",   "スージー",
   "スベトラーナ",   "シルビー",   "タバサ",   "タビサ",
   "タマラ",   "ヤマヤ",   "タミー",   "タラ",
   "タワンダ",   "テレサ",   "テリ",   "テッサ",
   "タチアナ",   "テリーサ",   "ザイラ",   "ティア",
   "ティフ",   "ティファニー",   "ティーファ",   "ティナ",
   "トニー",   "トーリ",   "トリシア",   "トリッシュ",
   "トルディ",   "タイラ",   "バレンティナ",   "バレリア",
   "バレリ",   "バンパイラ",   "バネッサ",   "ビーナス",
   "ベレナ",   "ベロニカ",   "ベスナ",   "バージニア",
   "ビッキー",   "ビキー",   "ビクトリア",   "バイオレット",
   "ビサラ",   "ビビアン",   "ボニータ",   "ワンダ",
   "ウェンディ",   "ウーピー",   "ウィルヘルミーナ",   "ウィロー",
   "ウィルマ",   "ウィニフレッド",   "ジニア",   "エカテリーナ",
   "ヨーコ",   "ヨランダ",   "ユリア",   "イボンヌ",
   "ザハワ",   "ザリーナ",   "ゼナ",   "ゼルダ",
   "ゾーイ",   "ゾフィア",   "ジョーフィア",   "ズザナ"
   };

   // these names should not appear in the male or female
   // or great white male patriarch first name lists, only here
   static const char *gender_neutral_first_names[] =
   {
   "エイドリアン",   "アキラ",   "アレックス",   "アレクシス",
   "アリ",   "エンジェル",   "エリアル",   "アシュレイ",
   "ビバリー",   "ビリー",   "ブレア",   "ボビー",
   "ボビー",   "ブレット",   "ブリート",   "カメロン",
   "カミーユ",   "ケイシー",   "チャス",   "チャズ",
   "クリス",   "コディー",   "コーリー",   "コートニー",
   "ダナ",   "フランキー",   "ハイデン",   "ヒラリー",
   "ケリー",   "ジャッキー",   "ジェイミー",   "ジェイデン",
   "ジーン",   "ジェス",   "ジョ",   "ジョーダン",
   "ジョイス",   "ジュン",   "ケルシー",   "ケルジー",
   "ケネディ",   "キム",   "キンバリー",   "キンバリー",
   "クリス",   "リー",   "レス",   "レスリー",
   "レズリー",   "リンジー",   "リンゼー",   "ローガン",
   "ルー",   "マディソン",   "マオ",   "マックス",
   "メル",   "モーガン",   "ナット",   "ニッキ",
   "ニッキー",   "ノエル",   "オーリー",   "ページ",
   "ペイジ",   "パリ",   "パット",   "ランマ",
   "レイブン",   "ライリー",   "ロビン",   "ローワン",
   "サム",   "サンディ",   "サシャ",   "シャロン",
   "シドニー",   "スティーブ",   "テイラー",   "テリー",
   "トレイシー",   "バル",   "ユェンピン",   "ユリ"
   };

   // these Arch-Conservative names also all appear under the male names list too
   // and NONE of them are female or gender-neutral
   // (no "Chris", that can be short for Christine or Christina)
   static const char *great_white_male_patriarch_first_names[] =
   {
   "アラン",   "アンディ",   "アーサー",   "ベン",
   "ビル",   "ボブ",   "ブラド",   "ブライアン",
   "カール",   "コリン",   "ダン",   "デイブ",
   "デニス",   "ディック",   "ドナルド",   "ダグ",
   "エド",   "エドワード",   "エリック",   "フランク",
   "ゲイリー",   "グレッグ",   "ハリー",   "ヘンリー",
   "ジェームス",   "ジェイソン",   "ジェフ",   "ジェリー",
   "ジェシー",   "ジム",   "ジョー",   "ジョン",
   "ジョシュ",   "ケン",   "ケビン",   "カイル",
   "ラリー",   "ルーク",   "マーク",   "マット",
   "マイク",   "ニック",   "ポール",   "ピーター",
   "レイ",   "リック",   "ロジャー",   "ロン",
   "ライアン",   "スコット",   "スティーブ",   "テッド",
   "ティム",   "トム",   "トミー",   "ウォルト"
   };

   strcpy(str,"");

   int roll, nametable;

   // If we don't care if the name is male or female, pick one randomly
   // This ensures gender balance in the names chosen
   if(gender == GENDER_NEUTRAL)
      gender = (LCSrandom(2)?GENDER_MALE:GENDER_FEMALE);

   // For white male Arch-Conservative politicians
   if(gender == GENDER_WHITEMALEPATRIARCH)
      nametable = GENDER_WHITEMALEPATRIARCH;

   // Assign a name from the available names for each gender
   if(gender == GENDER_MALE)
   {
      // Roll on the number of gender-specific names,
      // plus the number of gender-neutral names
      roll = LCSrandom(len(male_first_names) +
                       len(gender_neutral_first_names));
      // Decide whether to use a gender-specific name
      // or a gender-neutral name
      if(roll >= len(gender_neutral_first_names))
         nametable = GENDER_MALE;
      else
         nametable = GENDER_NEUTRAL;
   }
   else if(gender == GENDER_FEMALE)
   {
      // (Same here, just use the number of female names instead)
      roll = LCSrandom(len(female_first_names) +
                       len(gender_neutral_first_names));
      if(roll >= len(gender_neutral_first_names))
         nametable = GENDER_FEMALE;
      else
         nametable = GENDER_NEUTRAL;
   }

   if(nametable == GENDER_MALE)
      strcat(str, pickrandom(male_first_names));
   else if(nametable == GENDER_FEMALE)
      strcat(str, pickrandom(female_first_names));
   else if(nametable == GENDER_NEUTRAL)
      strcat(str, pickrandom(gender_neutral_first_names));
   else if(nametable == GENDER_WHITEMALEPATRIARCH)
      strcat(str, pickrandom(great_white_male_patriarch_first_names));
   else
      strcat(str, "エラール");
}
/* gets a random last name */
void lastname(char *str, bool archconservative)
//{{{ Last Name
{
   // note: every last name should only occur ONCE in either this list
   // or the Arch-Conservative list
   static const char *regular_last_names[] =
   {
   "アビー", "アボット", "アブズグ", "アブラモビッチ",
   "アダムソン", "アドキンス", "アフリカ", "アギレラ",
   "アハメド", "アーン", "アランソン", "オルコット",
   "アルダ", "アリ", "アランショー", "アレー",
   "アルバレス", "アンドレス", "アニストン", "アナン",
   "アントラー", "アップルトン", "アラファト", "アームステッド",
   "アーナズ", "アートフィールド", "アシュモア", "アル＝アサド",
   "アサンジ", "エアーズ", "エイクロイド", "アズレ",
   "バコール", "ベーコン", "ベアード", "ボールドウィン",
   "バルゴ", "バログ", "バーラーニ", "バロー",
   "バーウィック", "ボーモント", "ベッカー", "ベンディクス",
   "バイデン", "バーキン", "ビトン", "ブランチャード",
   "ブリッツァ", "ボガート", "ボッグス", "ボルジャー",
   "ブッカー", "ボサンケ", "ブラッドベリ", "ブラッドリー",
   "ブラッドショー", "ブランディス", "ブリュースター", "ブレイヤー",
   "ブライトマン", "ブリスコー", "ブラウンリー", "ブライアント",
   "バックマン", "バックナー", "バグビー", "バンプ",
   "バントン", "バーグホフ", "ブッチャー", "バトラー",
   "バット", "バターマン", "バットマン", "カーベリー",
   "カー", "カーソン", "カーター", "カートライト",
   "カストロ", "カバレロ", "カビル", "チェンバレン",
   "チャン", "チャンドラー", "チェン", "チャニング",
   "チャオ", "チャウ", "チャベス", "チアン",
   "チュン", "チルドレス", "チャイルズ", "チルトン",
   "チウ", "チョ", "チョウイ", "チョムスキー",
   "チャウ", "チュ", "チャブ", "ツォン",
   "クラビン", "クリントン", "クルーニー", "コッフィ",
   "コーエン", "コルコード.", "コロンブ", "コナー",
   "コーパースミス", "コープランド", "コッポラ", "コルデロ",
   "コスグローブ", "コトレル", "コート", "クラフト",
   "クリッチュリー", "クロフト", "クロムウェル", "クロス",
   "クロウ", "クロウソン", "クルーズ", "クオモ",
   "カーニュー", "カトラス", "カトラー", "ダーハン",
   "デイモン", "デインズ", "デンジャーフィールド", "ダンテ",
   "ダルナン", "ダッシュ", "ドーキンス", "デビソン",
   "デイ", "ディーン", "デルガド", "デロリアン",
   "デンチ", "デ・ニーロ", "デント", "デンツ",
   "ディアス", "ディメオラ", "ドミンガス", "ドルガン",
   "ドーシー", "ドウセット", "ダグラス", "ダウニー",
   "ダウニング", "ドラモンド", "ドゥエル", "デュカキス",
   "デュバル", "アール", "イーバート", "エドワーズ",
   "シュタイン", "イングリッシュ", "エスコバル", "エリクソン",
   "ユーバンクス", "アル＝ファーディル", "フェアバンクス", "フェアチャイルド",
   "ファルコ", "ファルスタッフ", "ファーカス", "ファンスワース",
   "ファー", "フォークナー", "ファインゴールド", "フェケーテ",
   "フェノリオ", "フィドルボトム", "フィラー", "フィンプル",
   "フィングルトン", "フィン", "フローレス", "フォートミュラー",
   "フランス", "フランク", "フランケン", "フロスト",
   "フレンド", "ファッジ", "フルサム", "ファーリー",
   "フシミ", "ガリントー", "カオ", "ガルシア",
   "ガルニエ", "ガシアン", "ゲルバート", "ゲッパート",
   "ギルバート", "ギルマウス", "ギルピン", "ギンズバーグ",
   "ギンズブルク", "ゴドウィン", "グリーブス", "ゴールドバーグ",
   "ゴールドスタイン", "ゴメス", "ゴンザレス", "グッドマン",
   "ゴア", "ゴルバチョフ", "ゴボロフ", "グラント",
   "グレイソン", "グリーン", "グリーンバーグ", "グリハルバ",
   "グローバー", "クー", "クォ", "グプタ",
   "グティエレス", "ガイ", "ハラス", "ホール",
   "ハモンド", "ハン", "ハーン", "ハンネマン",
   "ハッチャー", "ホーキング", "ハヤシ", "ヘイズ",
   "ヘイマー", "フー", "ヘッドリー", "ヒース",
   "ヘルマン", "ヘルトン", "ヘミングウェイ", "ヘンドレン",
   "ヘンドリックス", "ヘプバーン", "ヘプディッチ", "ヒューソン",
   "ヘイデューク", "ハイアセン", "ヒリアード", "ヒムルスタイン",
   "ホー", "ホディノット", "ホルダー", "ホンダ",
   "ホン", "フッカー", "ホープ", "ホッパー",
   "ホーンバーガー", "ホルバート", "ホートン", "ハウスマン",
   "ハワード", "ハウ", "スウ", "フ",
   "ファン", "ハフィントン", "ハニカット", "フセイン",
   "ハチソン", "ホワン", "イバラ", "イングルドン",
   "インキング", "イノウエ", "アービン", "アービング",
   "イスカリアット", "アイザックソン", "イトウ", "イバンソン",
   "アイブズ", "チャン", "ジェファーソン", "ジョン",
   "ジミソン", "ジョリー", "ジョーダン", "ジョイス",
   "ユハス", "ジャスティス", "カガン", "カルテンブルンナー",
   "カン", "カオ", "カーダシアン", "カルザイ",
   "カトウ", "キートン", "キーツ", "キーン",
   "カイテル", "ケネディ", "カーショウ", "ケステン",
   "キルボーン", "キルマー", "キム", "キムラ",
   "キンデイル", "キンズロウ", "キス", "キッチン",
   "コバヤシ", "コカーノット", "コプロウスキー", "コバクス",
   "クラスノウ", "クリーガー", "クリシュナ", "クルーグマン",
   "クシニッチ", "クンスラー", "クロサワ", "コック",
   "クォン", "ビン・ラディン", "ラカトシュ", "ラム",
   "ラサガ", "ローダー", "ロウ", "リー",
   "リーブス", "レンゲル", "レーニン", "レノン",
   "レビー", "ルインスキー", "レイデン", "リ",
   "リム", "リン", "リンカーン", "リンビル",
   "リップマン", "リュー", "ロー", "ローブ",
   "ログスドン", "ランゴバルド", "ロンドン", "ロペス",
   "ラブクラフト", "ロウコート", "ロウリー", "ルーカス",
   "ルナ", "ルオ", "ラシントン", "ルジンスキー",
   "ライルズ", "ライナム", "バン・リンデン", "ライアンズ",
   "マ", "マキノン", "マクラウド", "マクネイル",
   "メイシー", "マドー", "マラカイ", "マルコビッチ",
   "マローン", "マンデラ", "マン", "マニング",
   "マンスフィールド", "マーチ", "マースデン", "マーシュ",
   "マーシャル", "マルクス", "マザーズ", "マチソン",
   "マシューソン", "マシューズ", "マツモト", "マクスウェル",
   "マクアダムス", "マカリスター", "マクブルーム", "マッコーケル",
   "マクファデン", "マクファトリッジ", "マクフォール", "マクフライ",
   "マギー", "マクガバン", "マクグラス", "マグロウ",
   "マクギネス", "マッキントッシュ", "マッキンタイア", "マッケンジー",
   "マッキニー", "マクラウド", "マクマリー", "マクナブ",
   "マクファイル", "マクファソン", "マックイーン", "ミーク",
   "メファート", "メイア", "メレンデス", "メネデンス",
   "メーサーロシュ", "メッツガー", "ミフネ", "ミルバーン",
   "ミヤモト", "ミズラヒ", "ムハンマド", "モリナール",
   "モンデール", "モンターク", "モンタルボ", "モロトフ",
   "ムーン", "ムーア", "モラレス", "モリソン",
   "モロー", "モートン", "モズレー", "ミュラー",
   "マレル", "マスカット", "ムシャラフ", "ムスヘリシビーリ",
   "ムッサ", "マイヤット", "ネーダー", "ナーゲル",
   "ナーデルベルク", "ナージ", "ナカガワ", "ナカハラ",
   "ナカムラ", "ナレ", "ナンセ", "ナッシュ",
   "ナサンソン", "ネッケル", "ネメス", "ネトル",
   "ニューワース", "ネビンソン", "ニューベリー", "ニューホック",
   "ウン", "ニコル", "ニクソン", "オ",
   "オバマ", "オベイド", "オーバーレンダー", "オックス",
   "オグデン", "オー", "オラー", "オルバーマン",
   "オールド", "オールズ", "オールドスマー", "オラレンショウ",
   "オーランド", "オルティーズ", "オズボーン", "パチーノ",
   "パルトロー", "パオレッティ", "パーム", "パップ",
   "パーク", "パーキング", "パー", "パテル",
   "パターソン", "ピアソン", "ペック", "ペグ",
   "ペロシ", "ペルトン", "ペンダーグラス", "ペン",
   "ペレツ", "ペレ", "パート", "ペーターマン",
   "ファイファー", "ピケット", "ピケティ", "ピアース",
   "ピット", "ポメルレンケ", "ポンパー", "ポーカロ",
   "ポーター", "ポストマン", "ポンド", "パワーズ",
   "プロプスト", "プラウドフット", "プエンテ", "パーセル",
   "プーチン", "クエイド", "クィーン", "ケネル",
   "クイック", "キリコ", "キリアム", "クイティー",
   "クインシー", "クイリバン", "クイン", "クワーク",
   "ラバン", "ラッカード", "ラーチュ", "ラッドマン",
   "レイニー", "ロミレズ", "ラモス", "ランデル",
   "ランヘル", "ランサム", "ラパポート", "ラスキン",
   "ラストレッリ", "ラザー", "ラッツェンバーガー", "レイブンヒル",
   "ロールズ", "リード", "リーティング", "リーズナー",
   "バン・レヒテレン", "レッドフォード", "レッドマン", "レッドワイン",
   "ライド", "リーカーズ", "レイド", "レンデル",
   "レクスフォード", "リッチ", "リヒテル", "リドー",
   "リフル", "リベラ", "リバーズ", "ローダム",
   "ロドリゲス", "ローホ", "ローランド", "ルーズベルト",
   "ローズ", "ローゼンバーグ", "ロス", "ロータ",
   "ロススタイン", "ロイ", "ロイランス", "ラドキン",
   "ラッシュ", "ラッシュワース", "ラルーサ", "ラッセル",
   "ライマン", "サベーラ", "サドラー", "サドラー",
   "サイトウ", "サンチェス", "サンダース", "サンソン",
   "サンティアゴ", "サントス", "ササキ", "サトウ",
   "セルバンテス", "サクストン", "スケールス", "スカーディーノ",
   "シュミット", "シュナイダー", "シュローダー", "シュミット",
   "シューマッハ", "シューマー", "シュスター", "スカリー",
   "スカーフィールド", "シーロック", "シーイ", "サインフェルド",
   "セラーズ", "ショーミン", "セオ", "サーリング",
   "シーウォール", "セクストン", "シャクルトン", "シャグウェル",
   "アル＝シャミー", "シャープ", "シャープトン", "シェッド",
   "シーン", "シェルトン", "シェンジ", "シェパード",
   "シェパードソン", "シェパード", "ショウ", "シールズ",
   "シラー", "シマズ", "シミズ", "シン",
   "シップマン", "シップ", "ショー", "シュラプネル",
   "シュラム", "シュルツ", "シャムウェイ", "シュリン",
   "サイドボトム", "シーゲル", "シルバー", "ダ・シルバ",
   "シルバーマン", "シルバースタイン", "シモンズ", "シムス",
   "シモン", "シング", "アッ＝シーシー", "スキッドモア",
   "スキロー", "スクトニク", "スカイ", "スカイラー",
   "スレイトン", "スモーリー", "スモールウッド", "スマート",
   "スマイス", "スニード", "スヌーク", "スノーデン",
   "ソリス", "ソマー", "ゾンマー", "ソング",
   "ソーレン", "ソトマイヨール", "サウター", "スペイシー",
   "スピルバーグ", "ラドスラフ", "スピッツァー", "スターリン",
   "スタング", "スターク", "スタークウェザー", "スタッセン",
   "ステリング", "スティブンスン", "スターニン", "スティーブンス",
   "スティーブンソン", "スチュワート", "ストックトン", "ストーム",
   "ストームズ", "スタイバー", "ストレイン", "ストラリー",
   "ストラアブ", "ストライプ", "ストロッセン", "スワーブ",
   "ツースーター", "スレイマン", "サン", "サーノウ",
   "ズースマン", "スズキ", "スウェイン", "スワイン",
   "スイフト", "スイット", "サイミントン", "シモンズ",
   "スザボ'", "タブ", "タルボイズ", "タカクス",
   "タカハシ", "タカヨシ", "タルバート", "タルボット",
   "タルボット", "タルティ", "タナカ", "タナー",
   "タランティーノ", "タッターソル", "タウプマン", "タヨ",
   "タイゲ", "テル", "テネント", "テニー",
   "テンペニー", "テリル", "テストーレ", "テトリー",
   "ジギスモント", "トマス", "トムソン", "ソーン",
   "スリープウッド", "マーシャル", "サーロー", "ティッケル",
   "ティレット", "ティリンガスト", "ティルソン", "ティルズリー",
   "ティモンズ", "ティペット", "ティズダル", "ティシュマン",
   "ティットクーム", "トービン", "トッド", "トッドハンター",
   "トフト", "トルバート", "トールキン", "トルソン",
   "トネリ", "トゥーグッド", "トゥック", "トウール",
   "トート", "タウン", "タウンゼント", "トラフォード",
   "トラボルタ", "トレベック", "トロツキー", "トルーマン",
   "チュオン", "ツイ", "タブス", "タブマン",
   "トウェイン", "ティーマッキシン", "ウルマー", "アンダーヒル",
   "アンダーダウン", "アンダーウッド", "アップダイク", "アッシャー",
   "アッシャー", "バルディーズ", "バランス", "バンス",
   "バーガ", "バシレフスキー", "ビーナス", "ビラ",
   "ビヤヌエバ", "ビスキューソ", "ボーランド", "ボルカー",
   "ウェイド", "ウォズワース", "ウォールデン", "ウォルウィン",
   "ワン", "ウォード", "ワールマン", "ウォー",
   "ウォーレン", "ワシントン", "ワタナベ", "ワックスマン",
   "ウェザーズ", "ウェーバー", "ウェバー", "ウィークス",
   "ウェラー", "ウェルストン", "ウェント", "ウェストレイク",
   "ウエストン", "ウェイガン", "ホワイトヘッド", "ホイットリー",
   "ウィックス", "ウィレット", "ウィリアムソン", "ウィルマン",
   "ウィンチェスター", "ウィンフリー", "ウィンケルマン", "ウィンズロー",
   "ウィンター", "ワイズマン", "ウォルフ", "ワン",
   "ウッドロウ", "ウッズ", "ウー", "ウォーノス",
   "シェイ", "シュエ", "ヤマダ", "ヤマグチ",
   "ヤマモト", "ヤン", "ヤンコビック", "イー",
   "エリツィン", "ヤークオービック", "イ", "イム",
   "リュ", "ユン", "ヨシダ", "ヤングブラッド",
   "ユ", "ユエ", "リーバイ", "ザドラ",
   "ザハロフ", "ゼール", "サパタ", "ザッパ",
   "ゼドナー", "ツォートン", "チャン", "チャオ",
   "チョウ", "ヂゥー", "ジクリー", "ジート",
   "ズロートフ", "ゾンダーバン", "ザッカー", "ツムバッハ"
   };

   // these names are approved for use by Arch-Conservatives,
   // but will also sometimes appear as names for regular people too
   // last names for famous conservatives, fascists, European royalty, billionaires,
   // serial killers, and common, generic WASPy Anglo-Saxon names go here,
   // but be sure to exclude last names of famous liberals and communists,
   // instead those go in the previous list (otherwise we end up with
   // Arch-Conservatives with names like Bill Clinton!)
   static const char *archconservative_last_names[] =
   {
   "アダムス", "アデルソン", "アグニュー", "アキン",
   "アレクサンダー", "アリート", "アレン", "エイムズ",
   "アンダーソン", "アーミー", "アームストロング", "アーノルド",
   "アシュクロフト", "アトウォーター", "バックマン", "ベイリー",
   "ベイカー", "ベカー", "バンクス", "バー",
   "ベイツ", "バクスター", "ベック", "ベニト",
   "バーコウィッツ", "ベルナドッテ", "ベゾス", "ビアンキ",
   "ビルダーバーグ", "ブラック", "ブランケンシップ", "ブルム",
   "ベイナー", "ボルトン", "ボナパルト", "ブルボン",
   "ボイド", "ボゼル", "ブラガンサ", "ブラント",
   "ブローン", "ブライトバート", "ブレマー", "ブルックス",
   "ブラウン", "ブキャナン", "バックリー", "バンディ",
   "ブオーノ", "バーンズ", "バー", "バートン",
   "ブッシュ", "バード", "カラハン", "キャメロン",
   "キャンベル", "カントール", "ケイリー", "カールソン",
   "カーライル", "カーネギー", "カーペンター", "チャフィー",
   "チェンバース", "チェイニー", "チャーチル", "クラーク",
   "クレイ", "コブ", "コルベア", "コール",
   "コールマン", "コリンズ", "コルト", "クック",
   "クーパー", "コール", "カフリン", "コールター",
   "コックス", "クレーン", "クロケット", "クルス",
   "カニンガム", "ダーマー", "ダンソン", "ダービー",
   "デビッドソン", "デービス", "デッカー", "ディア",
   "デラネイ", "ディレイ", "デミント", "ディール",
   "ディスコルディア", "ディズニー", "ディクソン", "ドブス",
   "ドブソン", "ドール", "ドイル", "ドレイク",
   "ドゥスーザ", "デューク", "ダフィールド", "ダナム",
   "ダンラップ", "アープ", "エリソン", "エバンス",
   "ファルエル", "フォークス", "フェンダーソン", "フィールズ",
   "フィッシェル", "フィッシャー", "フィッツジェラルド", "フィッツパトリック",
   "フレイク", "フランダース", "フレッチャー", "フォーブス",
   "フォード", "フォスター", "フォックス", "フランコ",
   "フランクリン", "フリードマン", "ゲイシー", "ギャラガー",
   "ゴルト", "ゲイツ", "ゲイン", "ゲッティ",
   "ギブソン", "ギングリッチ", "ジュリアーニ", "グリュックスブルク",
   "ゴーマート", "ゴールドウォーター", "グッディ", "グッドイヤー",
   "グラハム", "グラマー", "グレイ", "グレッグ",
   "グリフィン", "グリマルディ", "ハギー", "ハミルトン",
   "ハニティー", "ハノーバー", "ハンセン", "ハプスブルク",
   "ハーパー", "ハリス", "ハスタート", "ハイドニック",
   "ヘラー", "ヘルムズ", "ヘンダスン", "ヘンリー",
   "ヘス", "ヒル", "ヒン", "ヒトラー",
   "ホフマン", "ホーガン", "ホーエンツォレルン", "ホリデー",
   "ホームズ", "フーバー", "ホプキンス", "ハッカビー",
   "ハドソン", "ヒューズ", "ジャクソン", "ジェームス",
   "ジェムソン", "ジェンキンス", "ジョンソン", "ジョーンズ",
   "ジャッジ", "ケンパー", "ケント", "キーズ",
   "キング", "キッシンジャー", "コーク", "コレッシュ",
   "クラフト", "クラウトハマー", "クリストル", "カックリンスキー",
   "レイク", "ラングレー", "ルイス", "リンボー",
   "リトル", "ローガン", "ロット", "レーベ",
   "ルクセンブルク", "リンチ", "マッカーサー", "マクガイバー",
   "マホーニー", "マケイン", "マッカーシー", "マコーネル",
   "マクドナルド", "マッキンリー", "マクラフリン", "マクベイ",
   "メディチ", "マイヤー", "ミラー", "ミッチェル",
   "モンロー", "モンタナ", "モーガン", "モリス",
   "マリン", "マーフィー", "マリー", "ムッソリーニ",
   "マードック", "マイヤーズ", "ネルソン", "ネス",
   "ニューマン", "ニールソン", "ニクソン", "ノース",
   "ノバク", "オークリー", "オコナー", "オキーフ",
   "オレンジ", "オライリー", "オスマン", "オスティーン",
   "ペイリン", "パーマー", "パーカー", "ポール",
   "ペンドルトン", "ペリー", "ペロー", "ピーターソン",
   "フェルプス", "ピアス", "ピンカートン", "ポッター",
   "パウエル", "プレスリー", "プライアー", "クエール",
   "レーダー", "ランド", "レーガン", "レンキスト",
   "レイノルズ", "ローズ", "ライス", "リチャードソン",
   "ロベルト", "ロバートソン", "ロビンソン", "ロックフェラー",
   "ロマノフ", "ロムニー", "ロスチャイルド", "ローブ",
   "ルビオ", "ラムズフェルド", "ラザフォード", "サンフォード",
   "サントラム", " サベッジ", "サボイ", "ソーヤー",
   /*"ザクセン＝コーブルク＝ゴータ",*/ "スカリア", "シュラフリー", "スコット",
   "シャナハン", "ショー", "ショウクロス", "シェルビー",
   "シャーマン", "ショート", "シャトルワース", "シンプソン",
   "スキナー", "スミス", "スミサーズ", "スノー",
   "スナイダー", "ソウェル", "スピアーズ", "スペンサー",
   "スター", "スターリング", "ストーン", "シュトラウス",
   "ステュアート", "サリバン", "サトクリフ", "スワガート",
   "スワンソン", "スウィーニー", "タフト", "タイッツ",
   "テイラー", "テンプルトン", "サッチャー", "トーマス",
   "トンプソン", "サーモンド", "トルドー", "トランプ",
   "タッカー", "チューダー", "ターナー", "タイラー",
   "ウンルー", "アプトン", "ボイト", "ワーグナー",
   "ウォーカー", "ウォレス", "ウォルシュ", "ウォルトン",
   "ワーナー", "ワトソン", "ウェイン", "ウェブスター",
   "ウェスト", "ベッティン", "ホワイト", "ホイットマン",
   "ウィルコックス", "ウィリアムズ", "ウィルソン", "ウィンザー",
   "ウィッテルスバッハ", "ウッド", "ライト", "イェーツ",
   "ヨーダー", "ヤング", "ジマーマン", "ザッカーバーグ"
   };

   strcpy(str,"");

   // For non-Arch-Conservatives, pick from ALL last names
   if(!archconservative)
   {
      // Roll on the number of non-Arch-Conservative last names,
      // plus the number of regular last names
      int roll = LCSrandom(len(regular_last_names) +
                           len(archconservative_last_names));
      // Decide whether to use an Arch-Conservative last name
      // or a regular last name
      archconservative = (roll >= len(regular_last_names));
   }
   // Now the archconservative variable might be true even if the function wasn't called that way,
   // but if it WAS called that way it's definitely true... this way non-Arch-Conservatives get
   // random last names out of all the last names, while Arch-Conservatives are limited to their own
   // last names

   if(archconservative)
      strcat(str, pickrandom(archconservative_last_names));
   else
      strcat(str, pickrandom(regular_last_names));
}



/* convert to half width katakana */
char *to_half(char *str)
{
   static const struct
   {
      char *full;
      char *half;
   }
   kana[] =
   {
      { "＝", "=" },
      { "・", "･" },
      { "ー", "ｰ" },
      { "ァ", "ｧ" },
      { "ア", "ｱ" },
      { "ィ", "ｨ" },
      { "イ", "ｲ" },
      { "ゥ", "ｩ" },
      { "ウ", "ｳ" },
      { "ェ", "ｪ" },
      { "エ", "ｴ" },
      { "ォ", "ｫ" },
      { "オ", "ｵ" },
      { "カ", "ｶ" },
      { "ガ", "ｶﾞ" },
      { "キ", "ｷ" },
      { "ギ", "ｷﾞ" },
      { "ク", "ｸ" },
      { "グ", "ｸﾞ" },
      { "ケ", "ｹ" },
      { "ゲ", "ｹﾞ" },
      { "コ", "ｺ" },
      { "ゴ", "ｺﾞ" },
      { "サ", "ｻ" },
      { "ザ", "ｻﾞ" },
      { "シ", "ｼ" },
      { "ジ", "ｼﾞ" },
      { "ス", "ｽ" },
      { "ズ", "ｽﾞ" },
      { "セ", "ｾ" },
      { "ゼ", "ｾﾞ" },
      { "ソ", "ｿ" },
      { "ゾ", "ｿﾞ" },
      { "タ", "ﾀ" },
      { "ダ", "ﾀﾞ" },
      { "チ", "ﾁ" },
      { "ヂ", "ﾁﾞ" },
      { "ッ", "ｯ" },
      { "ツ", "ﾂ" },
      { "ヅ", "ﾂﾞ" },
      { "テ", "ﾃ" },
      { "デ", "ﾃﾞ" },
      { "ト", "ﾄ" },
      { "ド", "ﾄﾞ" },
      { "ナ", "ﾅ" },
      { "ニ", "ﾆ" },
      { "ヌ", "ﾇ" },
      { "ネ", "ﾈ" },
      { "ノ", "ﾉ" },
      { "ハ", "ﾊ" },
      { "バ", "ﾊﾞ" },
      { "パ", "ﾊﾟ" },
      { "ヒ", "ﾋ" },
      { "ビ", "ﾋﾞ" },
      { "ピ", "ﾋﾟ" },
      { "フ", "ﾌ" },
      { "ブ", "ﾌﾞ" },
      { "プ", "ﾌﾟ" },
      { "ヘ", "ﾍ" },
      { "ベ", "ﾍﾞ" },
      { "ペ", "ﾍﾟ" },
      { "ホ", "ﾎ" },
      { "ボ", "ﾎﾞ" },
      { "ポ", "ﾎﾟ" },
      { "マ", "ﾏ" },
      { "ミ", "ﾐ" },
      { "ム", "ﾑ" },
      { "メ", "ﾒ" },
      { "モ", "ﾓ" },
      { "ャ", "ｬ" },
      { "ヤ", "ﾔ" },
      { "ュ", "ｭ" },
      { "ユ", "ﾕ" },
      { "ョ", "ｮ" },
      { "ヨ", "ﾖ" },
      { "ラ", "ﾗ" },
      { "リ", "ﾘ" },
      { "ル", "ﾙ" },
      { "レ", "ﾚ" },
      { "ロ", "ﾛ" },
      { "ワ", "ﾜ" },
      { "ヲ", "ｦ" },
      { "ン", "ﾝ" },
      { "ヴ", "ｳﾞ" },
      { NULL, NULL }
   }, *t;
   static char wide_str[256];
   char *p=str;

   strcpy(wide_str,"");

   while(*p!=0)
   {
      for(t=kana;t->half!=NULL;t++)
      {
         if(memcmp(p,t->full,strlen(t->full))==0)
         {
            break;
         }
      }

      if(t->half!=NULL)
      {
         strcat(wide_str,t->half);
         p+=strlen(t->full);
      }
      else
      {
         wide_str[strlen(wide_str)+1]=0;
         wide_str[strlen(wide_str)]=*p;
         p++;
      }
   }

   return wide_str;
}
